doc/grammar.org
#+TITLE: ~cl-jackc~'s Grammar Language
#+AUTHOR: Lucas Vieira
#+EMAIL: lucasvieira@protonmail.com
#+LATEX_CLASS_OPTIONS: [a4paper,11pt,oneside]
#+LaTeX_HEADER: \usepackage{lmodern}
#+LaTeX_HEADER: \usepackage{microtype}
#+LaTeX_HEADER: \usepackage{listings}
#+LaTeX_HEADER: \usepackage{hyperref}
#+LaTeX_HEADER: \usepackage{mathtools}
#+LaTeX_HEADER: \usepackage{draftwatermark}
#+LaTeX_HEADER: \hypersetup{colorlinks, citecolor=black, filecolor=black, linkcolor=black, urlcolor=black}
#+OPTIONS: toc:nil num:1 email:t footer:nil

#+begin_center
/ABSTRACT/
#+end_center

#+LaTeX: \par\noindent
~cl-jackc~[fn:5] is an implementation of a compiler for the Jack
programming language. It uses its own grammar engine for language
grammars, written from scratch in Common Lisp. This article outlines
the domain-specific language for specifying grammar rules, its key
points, and my experience on building the matching engine which
interprets the grammar language.


* Introduction

Building programming languages is often an arduous, but fun task. Some
of the work lies on designing the language and its syntactical
elements. The rest of the work lies on building the tools
to make the language work, namely the compiler toolchain. In this
article, I discuss a fragment of the compiler toolchain for the Jack
programming language, one of the projects proposed by Nisan and
Schocken (2008) cite:nand2tetris, which is the parser for the syntax
analysis of the Jack programming language.

The related book provides a very clear grammar for Jack, and so the
job of the reader is to simply write a compiler for the language, in
two different projects[fn:4]. Here I show some of my strategies to
build the first of the projects, despite having zero experience on
writing compilers.

Nisan and Schocken (2008) cite:nand2tetris provide a blueprint for the
project software architecture in the Java language, so that the job of
the reader is sped up. This model, however, obeys certain principles
of object-oriented design which describe a very rigid software
architecture. Due to influence of Abelson and Sussman (1996)
cite:sicp, when primarily thinking of what to do, I did not view the
compiler architecture as a monolithic hierarchy of software modules,
interacting with each other. Though the modularization is still
maintained, mostly for file organization and for keeping some degree
of similarity with the proposed implementation, the syntax analyzer
was primarily designed as layers of software comprising of certain
abstractions, as if each of these layers were /domain-specific
languages/ themselves that could be used to build upper abstraction
layers.

This approach led me to build a de-facto /domain-specific language/
to represent the grammar of the Jack programming language in the
topmost level. It also acquired the intended effect of having an
underlying robust, simple and well-organized codebase. The formalisms
and operation of this topmost grammar language are detailed as follows.

* Grammars

According to Vieira (2006)cite:newton2006, a grammar is a formalism
originally conceived for defining formal languages. The fundamental
elements of grammars are the /rules/, which demonstrate how to generate
a language's /words/.

Let there be a grammar $G$, which is a tuple $(V, \Sigma, R, P)$
where:

- $V$ is a finite set of all language /variables/;
- $\Sigma$ is the language's alphabet, where $V \cap \Sigma =
  \varnothing$;
- $R$ is a finite set comprised of ordered pairs known as /rules/, and
- $P \in V$ is a variable known as a starting point.

A grammar $G$ is valid when it is possible to generate /sentential
forms/ from its rules, such that these /forms/ are not populated by any
/variable/, but only with /terminals/ ($\alpha \in \Sigma$). These special
/forms/ are often called /words/.The set of all /words/ generated by a
grammar is called $L(G)$, or /language of $G$/.

It is said that a /word/ $\omega$ belongs to $L(G)$ if, and only if,
$\omega$ can be derived in $n$ steps from $G$'s /rules/.

The /rules/ of a grammar, as already stated, are ordered pairs. The
first element of the pair states /what should be replaced/, and the
second element states /what is the replacement/. For example, consider
the following rules.

\begin{align}
A &\rightarrow aA\\
A &\rightarrow B\\
B &\rightarrow \lambda
\end{align}

These /rules/ belong to a certain type of grammar which will be crucial
to the incoming object of discussion. Given a starting point $A$, as
per Rule 1, it is possible to infer that this language is capable of
generating /sentential forms/ with an arbitrary number of "$a$"
/terminals/, plus a dangling "$A$" variable at the end. After that, $A$
can be transformed into $B$ (Rule 2), and $B$ is then transformed into
the /empty word/ $\lambda$ (Rule 3), which acts as the stopping point
for grammar generation, leaving only a /sentential form/ comprised of
/terminals/ (a /word/). This language may also be represented as
$\{a\}^{*}$.

The previous example is interesting because the left-hand part of all
rules is comprised only of /variables/. This means that, for any given
variable which may appear in a /sentential form/, that single variable
must have one or more corresponding rules which replace
it. Furthermore, it is only necessary to find and replace /variables/ in
the /sentential form/, and never to analyze the disposition of
/terminals/, since there are no /rules/ requiring this procedure.

A grammar for the Jack language (Simon and Schocken, 2008)
cite:nand2tetris is written using exactly this model. Each of the
/rules/ are a simple pair, where the first component is a /variable/ which
may appear anywhere, and so it can be transformed by another given
rule of the grammar. Using this simple theorem, it is possible to
write an application which takes a /source code/ and parses it, so that
this analysis indicates whether the /code/ is a /word/ of the Jack
/language/ or not.

