doc/grammar.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-05-07 ter 21:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title><code>cl-jackc</code>'s Grammar Language</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Lucas Vieira" />
</head>
<body>
<div id="preamble" class="status">
<h1 class="title"><code>cl-jackc</code>'s Grammar Language</h1><p><i>Written in  by Lucas Vieira<br/><a href="mailto:lucasvieira@protonmail.com">lucasvieira@protonmail.com</a></i></p>
</div>
<div id="content">
<h1 class="title"><code>cl-jackc</code>'s Grammar Language</h1>
<div class="org-center">
<p>
<i>ABSTRACT</i>
</p>
</div>

<p>
<code>cl-jackc</code><sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> is an implementation of a compiler for the Jack
programming language. It uses its own grammar engine for \(LL(1)\)
grammars, written from scratch in Common Lisp. This article outlines
the domain-specific language for specifying grammar rules, its key
points, and my experience on building the matching engine which
interprets the grammar language.
</p>


<div id="outline-container-org8558dde" class="outline-2">
<h2 id="org8558dde"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Building programming languages is often an arduous, but fun task. Some
of the work lies on the designing of the language and its syntactical
elements <i>per se</i>. The rest of the work lies on building the tools
to make the language work, namely the compiler toolchain. In this
article, I discuss a fragment of the compiler toolchain for the Jack
programming language, one of the projects proposed by Nisan and
Schocken (2008) <a class='org-ref-reference' href="#nand2tetris">nand2tetris</a>, which is the parser for the syntax
analysis of the Jack programming language.
</p>

<p>
The related book provides a very clear grammar for Jack, and so the
job of the reader is to simply write a compiler for the language, in
two different projects<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>. Here I show some of my strategies to
build the first of the projects, while having zero experience on
writing compilers.
</p>

<p>
Nisan and Schocken (2008) <a class='org-ref-reference' href="#nand2tetris">nand2tetris</a> provide a blueprint for the
project software architecture in the Java language, so that the job of
the reader is sped up. This model, however, obeys certain principles
of object-oriented design which describe a very rigid software
architecture. Due to influence of Abelson and Sussman (1996)
<a class='org-ref-reference' href="#sicp">sicp</a>, when primarily thinking of what to do, I did not view the
compiler architecture as a rigid hierarchy of software modules,
interacting with each other. While the modularization is still
maintained, mostly for file organization and for keeping some degree
of similarity with the proposed implementation, the syntax analyzer
was primarily designed as layers of software comprising of certain
abstractions, as if each of these layers were <i>domain-specific
languages</i> themselves that could be used to build upper abstraction
layers.
</p>

<p>
This approach led me to build a de-facto <i>domain-specific language</i>
to represent the grammar of the Jack programming language in the
topmost level. It also acquired the intended effect of having an
underlying robust, simple and well-organized codebase. The formalisms
and operation of this topmost grammar language are detailed as follows.
</p>
</div>
</div>

<div id="outline-container-org84c67c8" class="outline-2">
<h2 id="org84c67c8"><span class="section-number-2">2</span> Grammars</h2>
<div class="outline-text-2" id="text-2">
<p>
Vieira (2006)<a class='org-ref-reference' href="#newton2006">newton2006</a> states that a grammar is a formalism
originally conceived for defining formal languages. The fundamental
elements of grammars are the <i>rules</i>, which demonstrate how to generate
a language's <i>words</i>.
</p>

<p>
Let there be a grammar \(G\), which is a tuple \((V, \Sigma, R, P)\)
where:
</p>

<ul class="org-ul">
<li>\(V\) is a finite set of all language <i>variables</i>;</li>
<li>\(\Sigma\) is the language's alphabet, where \(V \cap \Sigma =
  \varnothing\);</li>
<li>\(R\) is a finite set comprised of ordered pairs known as <i>rules</i>, and</li>
<li>\(P \in V\) is a variable known as a starting point.</li>
</ul>

<p>
A grammar \(G\) is valid when it is possible to generate <i>sentential
forms</i> from its rules, such that these <i>forms</i> are not populated by any
<i>variable</i>, but only with <i>terminals</i> (\(\alpha \in \Sigma\)). These special
<i>forms</i> are often called <i>words</i>.The set of all <i>words</i> generated by a
grammar is called \(L(G)\), or <i>language of \(G\)</i>.
</p>

<p>
It is said that a <i>word</i> \(\omega\) belongs to \(L(G)\) if, and only if,
\(\omega\) can be derived in \(n\) steps from \(G\)'s <i>rules</i>.
</p>

<p>
The <i>rules</i> of a grammar, as already stated, are ordered pairs. The
first element of the pair states <i>what should be replaced</i>, and the
second element states <i>what is the replacement</i>. For example, consider
the following rules.
</p>

\begin{align}
A &\rightarrow aA\\
A &\rightarrow B\\
B &\rightarrow \lambda
\end{align}

<p>
These <i>rules</i> belong to a certain type of grammar which will be crucial
to the incoming object of discussion. Given a starting point \(A\), as
per Rule 1, it is possible to infer that this language is capable of
generating <i>words</i> with an arbitrary number of "\(a\)" <i>terminals</i>, plus a
dangling "\(A\)" variable at the end. After that, \(A\) can be transformed
into \(B\) (Rule 2), and \(B\) is then transformed into the <i>empty word</i>
\(\lambda\) (Rule 3), which acts as the stopping point for grammar
generation, leaving only a <i>word</i> comprised of <i>terminals</i>. This language
may also be represented as \(\{a\}^{*}\).
</p>

<p>
The previous example is interesting because the left-hand part of all
rules is comprised only of <i>variables</i>. This means that, for any given
variable which may appear in a <i>sentential form</i>, that single variable
must have one or more corresponding rules which replace
it. Furthermore, it is only necessary to find and replace <i>variables</i> in
the <i>sentential form</i>, and never to analyze the disposition of
<i>terminals</i>, since there are no <i>rules</i> requiring this procedure.
</p>

<p>
A grammar for the Jack language <a class='org-ref-reference' href="#nand2tetris">nand2tetris</a> is written using
exactly this model. Each of the <i>rules</i> are a simple pair, where the
first component is a <i>variable</i> which may appear anywhere, and so it can
be transformed by another given rule of the grammar. Using this simple
theorem, it is possible to write an application which takes a <i>source
code</i> and parses it, so that this analysis indicates whether the <i>code</i>
is a <i>word</i> of the Jack <i>language</i> or not.
</p>
</div>
</div>
