doc/grammar.org
* Compiler's grammar syntax

The compiler's grammar language is written using s-expressions, since
the application itself is written in Common Lisp. The chosen language
provides powerful abstractions for dealing with lists. The grammar is
written as an abstract syntax tree, so that Lisp makes it easier to
traverse each rule.

A grammar is a list of rules. Each rule is a pair of two elements: a
/name/ and a /match/. There must be at least one rule enumerating
/terminals/, which are expected textual elements.

/Names/ are Lisp keywords[fn:2], and therefore are prepended with a
double colon, so that they are agnostic to the namespace[fn:1] they're
in.

Figure [[fig:class_rule]] is a transcribed fragment of a single rule
for matching with a class structure of the Jack programming
language. The rule is provided for illustrative purposes.

#+name: fig:class_rule
#+label: fig:class_rule
#+caption: Rule for matching a class definition in the Jack language.
#+begin_src lisp
(:class   ((:keyword "class") :class-name (:symbol "{")
           (:many :class-var-dec)
           (:many :subroutine-dec)
           (:symbol "}")))
#+end_src
#+LaTeX: \hfill \break

The /match/ component of a rule is, in itself, a list, and so it carries
its own meaning. The /match/ may be populated by other /keyword names/,
/quantified rules/, /precise rules/ and /exact-matches/, which must also be
specified in the grammar itself.

Any valid Jack source code begins with a class definition, and so
~:CLASS~ corresponds to the starting point for the matching engine. The
code snippet at Figure [[fig:class_rule]] offers a way to expect a class
definition in the Jack programming language (adapted from Nisan and
Schocken (2005) cite:nand2tetris). To recognize a class, the grammar
expects the match of a /precise/ pattern, in the following order:

- An exact match with the keyword "~class~";
- The class's name, whatever it may be;
- An exact match with the symbol ~{~;
- Zero or more variable declarations, whatever it may be;
- Zero or more subroutine declarations, whatever it may be;
- An exact match with the symbol ~}~.

The matching engine works recursively, as it is suggested from the
/wishful thinking/ approach (Abelson and Sussman (1996) cite:sicp).
These operations (as well as the /match/ portion of the rule itself)
require better clarification of their underlying structure.

A valid grammar, when written in the grammar language, is comprised of
atomic rules, which enumerate most /primitives/, and of compound rules,
which enumerate a single kind of /primitive/ and some /means of
combination/ for the rest of the rules.

** Atomic rules

A rule is atomic if it is comprised of a single keyword. These rules
are of the same type of the rule /names/, as they are meant to be
replaced by the body of another rule by the matching engine.

There are also built-in atomic rules which do not need to appear on
the grammar, since they are primitive to the matching engine, and so
they are enumerated as follows:

- ~:IDENTIFIER~: Any name which does not start with a letter. Breaks
  before a ~:SYMBOL~ or any whitespace.
- ~:STRING-CONSTANT~: Any text surrounded with quotes. Cannot have any
  line breaks.
- ~:INTEGER-CONSTANT~: Any text comprised only of numbers and no
  ~:SYMBOL~ terminals.
- /Terminals/: Any text. The text can be written as a string constant
  for Lisp.

Since matching these rules require knowledge of what a ~:SYMBOL~ and a
~:KEYWORD~ are, these rules must always be defined for any grammar. They
can also be compared to the alphabet $\Sigma$ of a formal grammar
(Vieira (2006) cite:newton2006). This aspect will be discussed later,
in greater detail.

In a rule such as ~(:KEYWORD "class")~, the element ~"class"~ is a
/terminal/, as it is raw text expected to be at the matching source code
position. However, the rule as a whole is not atomic, as will be
further discussed in the following subsection.

** Compound rules

Any list in the /match/ element is a compound rule. Since the /match/
element itself is a list comprised of several sub-rules, it is also
considered as a compound rule, in accordance to one of the following
archetypes.

*** Quantified rules

A /compound rule/ is a /quantified rule/ when its first element is a
quantifier keyword. The quantifier changes the matching engine context
for the elements it encloses, following the meaning of the quantifier
keywords:

- ~:OR~: A disjunction of rules. Attempts to match, in order, each of
  the sub-rules it encloses. Stops when one of the rules is matched,
  and does not check for the remaining rules.
- ~:MAYBE~: Attempts to sequentially match the group of all enclosed
  sub-rules, but the matching is optional; failure on the matching
  process does not fail the rest of the grammar match (/zero-or-one/).
- ~:MANY~: Attempts to match the group of all enclosed sub-rules
  exhaustively, and keeps collecting the matching results until the
  repeating match fails (/zero-or-more/).

A /quantified rule/ such as =(:many :identifier)=, for example, will keep
collecting identifiers until there are no more identifiers to be
collected. When matching an identifier fails, then all previously
matched identifiers are collected. If no identifier was matched, the
match results in a neutral value, but never fails.

A rule such as ~(:maybe :identifier :integer-constant)~ will attempt to
match an identifier and then an integer constant. If any of those
structures are not matched, then the match results in a neutral
value, but never fails.

The rule ~(:or :identifier :integer-constant)~ attempts to match an
identifier. If the identifier is not found, it attempts to match an
integer constant. If the integer constant is also not found, then the
match results in failure.

