doc/grammar.html

<div id="outline-container-org26544bd" class="outline-2">
<h2 id="org26544bd"><span class="section-number-2">3</span> Compiler's grammar syntax</h2>
<div class="outline-text-2" id="text-3">
<p>
The compiler's grammar language is written using s-expressions, since
the application itself is written in Common Lisp. The chosen language
provides powerful abstractions for dealing with lists. The grammar is
written as an abstract syntax tree, so that Lisp makes it easier to
traverse each rule.
</p>

<p>
A grammar is a list of rules. Each rule is a pair of two elements: a
<i>name</i> and a <i>match</i>. There must be at least one rule enumerating
<i>terminals</i>, which are expected textual elements.
</p>

<p>
<i>Names</i> are Lisp keywords<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>, and therefore are prepended with a
double colon, so that they are agnostic to the namespace<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup> they're
in.
</p>

<p>
Figure <a href="#orgb30aada">1</a> is a transcribed fragment of a single rule
for matching with a class structure of the Jack programming
language. The rule is provided for illustrative purposes.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>Rule for matching a class definition in the Jack language.</label><pre class="src src-lisp" id="orgb30aada">(<span class="org-builtin">:class</span>   ((<span class="org-builtin">:keyword</span> <span class="org-string">"class"</span>) <span class="org-builtin">:class-name</span> (<span class="org-builtin">:symbol</span> <span class="org-string">"{"</span>)
           (<span class="org-builtin">:many</span> <span class="org-builtin">:class-var-dec</span>)
           (<span class="org-builtin">:many</span> <span class="org-builtin">:subroutine-dec</span>)
           (<span class="org-builtin">:symbol</span> <span class="org-string">"}"</span>)))
</pre>
</div>
<p>
The <i>match</i> component of a rule is, in itself, a list, and so it carries
its own meaning. The <i>match</i> may be populated by other <i>keyword names</i>,
<i>quantified rules</i>, <i>precise rules</i> and <i>exact-matches</i>, which must also be
specified in the grammar itself.
</p>

<p>
Any valid Jack source code begins with a class definition, and so
<code>:CLASS</code> corresponds to the starting point for the matching engine. The
code snippet at Figure <a href="#orgb30aada">1</a> offers a way to expect a class
definition in the Jack programming language (adapted from Nisan and
Schocken (2005) <a class='org-ref-reference' href="#nand2tetris">nand2tetris</a>). To recognize a class, the grammar
expects the match of a <i>precise</i> pattern, in the following order:
</p>

<ul class="org-ul">
<li>An exact match with the keyword "<code>class</code>";</li>
<li>The class's name, whatever it may be;</li>
<li>An exact match with the symbol <code>{</code>;</li>
<li>Zero or more variable declarations, whatever it may be;</li>
<li>Zero or more subroutine declarations, whatever it may be;</li>
<li>An exact match with the symbol <code>}</code>.</li>
</ul>

<p>
The matching engine works recursively, as it is suggested from the
<i>wishful thinking</i> approach (Abelson and Sussman (1996) <a class='org-ref-reference' href="#sicp">sicp</a>).
These operations (as well as the <i>match</i> portion of the rule itself)
require better clarification of their underlying structure.
</p>

<p>
A valid grammar, when written in the grammar language, is comprised of
atomic rules, which enumerate most <i>primitives</i>, and of compound rules,
which enumerate a single kind of <i>primitive</i> and some <i>means of
combination</i> for the rest of the rules.
</p>
</div>

<div id="outline-container-org10f7211" class="outline-3">
<h3 id="org10f7211">Atomic rules</h3>
<div class="outline-text-3" id="text-org10f7211">
<p>
A rule is atomic if it is comprised of a single keyword. These rules
are of the same type of the rule <i>names</i>, as they are meant to be
replaced by the body of another rule by the matching engine.
</p>

<p>
There are also built-in atomic rules which do not need to appear on
the grammar, since they are primitive to the matching engine, and so
they are enumerated as follows:
</p>

<ul class="org-ul">
<li><code>:IDENTIFIER</code>: Any name which does not start with a letter. Breaks
before a <code>:SYMBOL</code> or any whitespace.</li>
<li><code>:STRING-CONSTANT</code>: Any text surrounded with quotes. Cannot have any
line breaks.</li>
<li><code>:INTEGER-CONSTANT</code>: Any text comprised only of numbers and no
<code>:SYMBOL</code> terminals.</li>
<li><i>Terminals</i>: Any text. The text can be written as a string constant
for Lisp.</li>
</ul>

<p>
Since matching these rules require knowledge of what a <code>:SYMBOL</code> and a
<code>:KEYWORD</code> are, these rules must always be defined for any grammar. They
can also be compared to the alphabet \(\Sigma\) of a formal grammar
(Vieira (2006) <a class='org-ref-reference' href="#newton2006">newton2006</a>). This aspect will be discussed later,
in greater detail.
</p>

<p>
In a rule such as <code>(:KEYWORD "class")</code>, the element <code>"class"</code> is a
<i>terminal</i>, as it is raw text expected to be at the matching source code
position. However, the rule as a whole is not atomic, as will be
further discussed in the following subsection.
</p>
</div>
</div>

<div id="outline-container-org0f70c1a" class="outline-3">
<h3 id="org0f70c1a">Compound rules</h3>
<div class="outline-text-3" id="text-org0f70c1a">
<p>
Any list in the <i>match</i> element is a compound rule. Since the <i>match</i>
element itself is a list comprised of several sub-rules, it is also
considered as a compound rule, in accordance to one of the following
archetypes.
</p>
</div>

<div id="outline-container-orgcd588dc" class="outline-4">
<h4 id="orgcd588dc">Quantified rules</h4>
<div class="outline-text-4" id="text-orgcd588dc">
<p>
A <i>compound rule</i> is a <i>quantified rule</i> when its first element is a
quantifier keyword. The quantifier changes the matching engine context
for the elements it encloses, following the meaning of the quantifier
keywords:
</p>

<ul class="org-ul">
<li><code>:OR</code>: A disjunction of rules. Attempts to match, in order, each of
the sub-rules it encloses. Stops when one of the rules is matched,
and does not check for the remaining rules.</li>
<li><code>:MAYBE</code>: Attempts to sequentially match the group of all enclosed
sub-rules, but the matching is optional; failure on the matching
process does not fail the rest of the grammar match (<i>zero-or-one</i>).</li>
<li><code>:MANY</code>: Attempts to match the group of all enclosed sub-rules
exhaustively, and keeps collecting the matching results until the
repeating match fails (<i>zero-or-more</i>).</li>
</ul>

<p>
A <i>quantified rule</i> such as <code>(:many :identifier)</code>, for example, will keep
collecting identifiers until there are no more identifiers to be
collected. When matching an identifier fails, then all previously
matched identifiers are collected. If no identifier was matched, the
match results in a neutral value, but never fails.
</p>

<p>
A rule such as <code>(:maybe :identifier :integer-constant)</code> will attempt to
match an identifier and then an integer constant. If any of those
structures are not matched, then the match results in a neutral
value, but never fails.
</p>

<p>
The rule <code>(:or :identifier :integer-constant)</code> attempts to match an
identifier. If the identifier is not found, it attempts to match an
integer constant. If the integer constant is also not found, then the
match results in failure.
</p>
</div>
</div>
