doc/grammar.org
*** Exact-matches

A /compound rule/ is an /exact-match rule/ when comprised of two elements,
where its first element is an existing rule in the grammar, and the
second element is an expected /terminal/.

The /terminal/ element of an /exact-match rule/ must belong to a
disjunctively-quantified rule, where each element of the disjunction
is a /terminal/ text as well. This associated, disjunctive rule is not
supposed to be used in matching time, though it is important for
grammar verification.

Any /exact-match rule/ which uses a non-existing disjunctive rule, or
uses a /terminal/ which does not belong to the associated disjunctive
rule, is considered to be syntactically incorrect.

A rule such as ~(:KEYWORD "class")~ is a well-defined /exact-match rule/,
if and only if the grammar contains a rule as exemplified in Figure
[[fig:keyword_rule_example]].

#+name: fig_keyword_rule_example
#+label: fig:keyword_rule_example
#+caption: Example of a supporting rule for an /exact-match rule/.
#+begin_src lisp
(:KEYWORD   ((:OR "class" "constructor" "function" ...)))
#+end_src

*** Precise rules

A /precise rule/ is the commonest type of rule, as the /match/
element of a rule definition often falls into it. Moreover, any
non-disjunctively quantified rule ends up degenerating into a /precise
rule/, only changing the context where such /precise rule/ fails.

Any part of a /match/ element of a rule, which is also /compound/, but
does not fall into the previous categories, is a /precise rule/. In
other words, such rules are surrounded by parenthesis, but their first
element is not a quantifier, and they also do not fit the /exact-match
rule/ specification.

These /compound rules/ are basically enclosings for sub-rules which must
"travel" as a group, and so all of their sub-rules must always
match. Since a rule definition enumerates how it works, it is advised
that any /match/ portion of a rule definition should be a /precise rule/
itself.

A rule such as ~(:IDENTIFIER (:SYMBOL "=") :INTEGER-CONSTANT)~ is a
valid /precise rule/. The grammar expects three sub-rules to be matched
sequentially. Should any of them fail, then the whole group fails.

** Obligatory rules

As the matching engine was implemented, it was discovered that the
structure needed to assume that certain rules were to be
always expected. These obligatory rules, however, are lexical elements
which are common to most languages.

- ~:KEYWORD~: A disjunctively-quantified rule enumerating all text
  /terminals/ of the language which are /language keywords/.
- ~:SYMBOL~: A disjunctively-quantified rule enumerationg all text
  /terminals/ of the language which are /language symbols/.

Keywords and symbols enumerate nothing less than the alphabet $\Sigma$
of a language, and therefore act as the primary /terminals/ for any
other grammar rules.

Figure [[fig:jack_obligatory]] is a snippet showing the Jack language's
keywords and symbols, based on the language's grammar specification
(Nisan and Schocken (2008), pp. 208-209 cite:nand2tetris).

#+name: fig:jack_obligatory
#+label: fig:jack_obligatory
#+caption: Keywords and symbols as defined for the Jack language.
#+begin_src lisp
(:keyword  ((:or "class" "constructor" "function"
                 "method" "field" "static" "var"
                 "int" "char" "boolean" "void"
                 "true" "false" "null" "this" "let"
                 "do" "if" "else" "while" "return")))

(:symbol   ((:or "{" "}" "(" ")" "[" "]" "." ","
                 ";" "+" "-" "*" "/" "&" "|" "<"
                 ">" "=" "~")))
#+end_src

** Code commentary

Comments in any language are often surrounded by two tokens, which are
equivalent to text /terminals/. Comment detection, however, is not
considered part of the grammar rules, as they are treated as a
responsibility of the tokenizer.

The matching engine's topmost structure is responsible for comparing
tokens which are already assumed to be valid, and comment delimiters
(plus the contents of any comment) are not supposed to be valid
tokens. For that reason, the comments are defined using an outside
structure, a list of pairs which enumerate the tokens enclosing any
comments[fn:3].

Let us take the Jack programming language as an example, as the
matching engine was primarily built for it. A pair, in Lisp notation,
such as =("/*" . "*/")= shows that there may be comments in the source
file, which begin with the token =/*= and end with the token =*/=. And
so, the matching engine's head, which is supposed to point at every
read character, will simply skip the undesired characters -- both the
comment tokens and the text inbetween.

As for comments which end at a line break, a simple definition such as
=("//")= suffices. This definition can also be written in the form
=("//" . NIL)=, and so it implies that, when an end-of-comment delimiter
is not informed, then that delimiter must be a =#\Newline= character.

