doc/grammar.html

<div id="outline-container-org5edc4c0" class="outline-4">
<h4 id="org5edc4c0">Exact-matches</h4>
<div class="outline-text-4" id="text-org5edc4c0">
<p>
A <i>compound rule</i> is an <i>exact-match rule</i> when comprised of two elements,
where its first element is an existing rule in the grammar, and the
second element is an expected <i>terminal</i>.
</p>

<p>
The <i>terminal</i> element of an <i>exact-match rule</i> must belong to a
disjunctively-quantified rule, where each element of the disjunction
is a <i>terminal</i> text as well. This associated, disjunctive rule is not
supposed to be used in matching time, though it is important for
grammar verification.
</p>

<p>
Any <i>exact-match rule</i> which uses a non-existing disjunctive rule, or
uses a <i>terminal</i> which does not belong to the associated disjunctive
rule, is considered to be syntactically incorrect.
</p>

<p>
A rule such as <code>(:KEYWORD "class")</code> is a well-defined <i>exact-match rule</i>,
if and only if the grammar contains a rule as exemplified in Figure
<a href="#orga93985c">2</a>.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>Example of a supporting rule for an <i>exact-match rule</i>.</label><pre class="src src-lisp" id="orga93985c">(<span class="org-builtin">:KEYWORD</span>   ((<span class="org-builtin">:OR</span> <span class="org-string">"class"</span> <span class="org-string">"constructor"</span> <span class="org-string">"function"</span> ...)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdd33089" class="outline-4">
<h4 id="orgdd33089">Precise rules</h4>
<div class="outline-text-4" id="text-orgdd33089">
<p>
A <i>precise rule</i> is the commonest type of rule, as the <i>match</i>
element of a rule definition often falls into it. Moreover, any
non-disjunctively quantified rule ends up degenerating into a <i>precise
rule</i>, only changing the context where such <i>precise rule</i> fails.
</p>

<p>
Any part of a <i>match</i> element of a rule, which is also <i>compound</i>, but
does not fall into the previous categories, is a <i>precise rule</i>. In
other words, such rules are surrounded by parenthesis, but their first
element is not a quantifier, and they also do not fit the <i>exact-match
rule</i> specification.
</p>

<p>
These <i>compound rules</i> are basically enclosings for sub-rules which must
"travel" as a group, and so all of their sub-rules must always
match. Since a rule definition enumerates how it works, it is advised
that any <i>match</i> portion of a rule definition should be a <i>precise rule</i>
itself.
</p>

<p>
A rule such as <code>(:IDENTIFIER (:SYMBOL "=") :INTEGER-CONSTANT)</code> is a
valid <i>precise rule</i>. The grammar expects three sub-rules to be matched
sequentially. Should any of them fail, then the whole group fails.
</p>
</div>
</div>
</div>

<div id="outline-container-orgbdedd2f" class="outline-3">
<h3 id="orgbdedd2f">Obligatory rules</h3>
<div class="outline-text-3" id="text-orgbdedd2f">
<p>
As the matching engine was implemented, it was discovered that the
structure needed to assume that certain rules were to be
always expected. These obligatory rules, however, are lexical elements
which are common to most languages.
</p>

<ul class="org-ul">
<li><code>:KEYWORD</code>: A disjunctively-quantified rule enumerating all text
<i>terminals</i> of the language which are <i>language keywords</i>.</li>
<li><code>:SYMBOL</code>: A disjunctively-quantified rule enumerationg all text
<i>terminals</i> of the language which are <i>language symbols</i>.</li>
</ul>

<p>
Keywords and symbols enumerate nothing less than the alphabet \(\Sigma\)
of a language, and therefore act as the primary <i>terminals</i> for any
other grammar rules.
</p>

<p>
Figure <a href="#org02004c0">3</a> is a snippet showing the Jack language's
keywords and symbols, based on the language's grammar specification
(Nisan and Schocken (2008), pp. 208-209 <a class='org-ref-reference' href="#nand2tetris">nand2tetris</a>).
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>Keywords and symbols as defined for the Jack language.</label><pre class="src src-lisp" id="org02004c0">(<span class="org-builtin">:keyword</span>  ((<span class="org-builtin">:or</span> <span class="org-string">"class"</span> <span class="org-string">"constructor"</span> <span class="org-string">"function"</span>
                 <span class="org-string">"method"</span> <span class="org-string">"field"</span> <span class="org-string">"static"</span> <span class="org-string">"var"</span>
                 <span class="org-string">"int"</span> <span class="org-string">"char"</span> <span class="org-string">"boolean"</span> <span class="org-string">"void"</span>
                 <span class="org-string">"true"</span> <span class="org-string">"false"</span> <span class="org-string">"null"</span> <span class="org-string">"this"</span> <span class="org-string">"let"</span>
                 <span class="org-string">"do"</span> <span class="org-string">"if"</span> <span class="org-string">"else"</span> <span class="org-string">"while"</span> <span class="org-string">"return"</span>)))

(<span class="org-builtin">:symbol</span>   ((<span class="org-builtin">:or</span> <span class="org-string">"{"</span> <span class="org-string">"}"</span> <span class="org-string">"("</span> <span class="org-string">")"</span> <span class="org-string">"["</span> <span class="org-string">"]"</span> <span class="org-string">"."</span> <span class="org-string">","</span>
                 <span class="org-string">";"</span> <span class="org-string">"+"</span> <span class="org-string">"-"</span> <span class="org-string">"*"</span> <span class="org-string">"/"</span> <span class="org-string">"&amp;"</span> <span class="org-string">"|"</span> <span class="org-string">"&lt;"</span>
                 <span class="org-string">"&gt;"</span> <span class="org-string">"="</span> <span class="org-string">"~"</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb93490a" class="outline-3">
<h3 id="orgb93490a">Code commentary</h3>
<div class="outline-text-3" id="text-orgb93490a">
<p>
Comments in any language are often surrounded by two tokens, which are
equivalent to text <i>terminals</i>. Comment detection, however, is not
considered part of the grammar rules, as they are treated as a
responsibility of the tokenizer.
</p>

<p>
The matching engine's topmost structure is responsible for comparing
tokens which are already assumed to be valid, and comment delimiters
(plus the contents of any comment) are not supposed to be valid
tokens. For that reason, the comments are defined using an outside
structure, a list of pairs which enumerate the tokens enclosing any
comments<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup>.
</p>

<p>
Let us take the Jack programming language as an example, as the
matching engine was primarily built for it. A pair, in Lisp notation,
such as <code>("/*" . "*/")</code> shows that there may be comments in the source
file, which begin with the token <code>/*</code> and end with the token <code>*/</code>. And
so, the matching engine's head, which is supposed to point at every
read character, will simply skip the undesired characters &#x2013; both the
comment tokens and the text inbetween.
</p>

<p>
As for comments which end at a line break, a simple definition such as
<code>("//")</code> suffices. This definition can also be written in the form
<code>("//" . NIL)</code>, and so it implies that, when an end-of-comment delimiter
is not informed, then that delimiter must be a <code>#\Newline</code> character.
</p>
</div>
</div>
</div>
